In [1]:
import numpy as np
import pandas as pd

In [12]:
data = {
    "OrderId": [101,102,103,104,105],
    "CustomerId": [1,2,3,4,1],
    "Product": ["موبایل", "تلویزیون", "موبایل", "هدفون", "لبتاب"],
    "Price": [1500, 200, 800, 12500, 800],
    "Quantity": [1,2,3,2,1],
    "OrderDate": ["2023-01-15", "2023-01-16", "2023-01-16", "2023-01-17", None]
}

In [13]:
df = pd.DataFrame(data, index=[1,2,3,4,5])
df

   OrderId  CustomerId   Product  Price  Quantity   OrderDate
1      101           1    موبایل   1500         1  2023-01-15
2      102           2  تلویزیون    200         2  2023-01-16
3      103           3    موبایل    800         3  2023-01-16
4      104           4     هدفون  12500         2  2023-01-17
5      105           1     لبتاب    800         1        None

In [14]:
df.head(2)

   OrderId  CustomerId   Product  Price  Quantity   OrderDate
1      101           1    موبایل   1500         1  2023-01-15
2      102           2  تلویزیون    200         2  2023-01-16

In [15]:
df.tail(2)

   OrderId  CustomerId Product  Price  Quantity   OrderDate
4      104           4   هدفون  12500         2  2023-01-17
5      105           1   لبتاب    800         1        None

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   OrderId     5 non-null      int64
 1   CustomerId  5 non-null      int64
 2   Product     5 non-null      object
 3   Price       5 non-null      int64
 4   Quantity    5 non-null      int64
 5   OrderDate   4 non-null      object
dtypes: int64(4), object(2)
memory usage: 280.0+ bytes

In [17]:
df.describe(include="all")

           OrderId  CustomerId Product        Price  Quantity   OrderDate
count     5.000000     5.00000       5      5.00000   5.00000           4
unique         NaN         NaN       4          NaN       NaN           3
top            NaN         NaN  موبایل          NaN       NaN  2023-01-16
freq           NaN         NaN       2          NaN       NaN           2
mean    103.000000     2.20000     NaN   3160.00000   1.80000         NaN
std       1.581139     1.30384     NaN   5241.46926   0.83666         NaN
min     101.000000     1.00000     NaN    200.00000   1.00000         NaN
25%     102.000000     1.00000     NaN    800.00000   1.00000         NaN
50%     103.000000     2.00000     NaN    800.00000   2.00000         NaN
75%     104.000000     3.00000     NaN   1500.00000   2.00000         NaN
max     105.000000     4.00000     NaN  12500.00000   3.00000         NaN

In [18]:
df.isna()

   OrderId  CustomerId  Product  Price  Quantity  OrderDate
1    False       False    False  False     False      False
2    False       False    False  False     False      False
3    False       False    False  False     False      False
4    False       False    False  False     False      False
5    False       False    False  False     False       True

In [19]:
df.isna().sum()

OrderId       0
CustomerId    0
Product       0
Price         0
Quantity      0
OrderDate     1
dtype: int64

In [20]:
df["OrderDate"] = df["OrderDate"].fillna("2023-01-18")

In [22]:
df.head()

   OrderId  CustomerId   Product  Price  Quantity   OrderDate
1      101           1    موبایل   1500         1  2023-01-15
2      102           2  تلویزیون    200         2  2023-01-16
3      103           3    موبایل    800         3  2023-01-16
4      104           4     هدفون  12500         2  2023-01-17
5      105           1     لبتاب    800         1  2023-01-18

In [23]:
df["OrderDate"] = pd.to_datetime(df["OrderDate"])
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   OrderId     5 non-null      int64
 1   CustomerId  5 non-null      int64
 2   Product     5 non-null      object
 3   Price       5 non-null      int64
 4   Quantity    5 non-null      int64
 5   OrderDate   5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 280.0+ bytes

In [24]:
# df = df.drop_duplicates("Product")

In [25]:
df = df.rename(columns= {"Product": "ProductName"})
df.head()

   OrderId  CustomerId ProductName  Price  Quantity  OrderDate
1      101           1      موبایل   1500         1 2023-01-15
2      102           2    تلویزیون    200         2 2023-01-16
3      103           3      موبایل    800         3 2023-01-16
4      104           4       هدفون  12500         2 2023-01-17
5      105           1       لبتاب    800         1 2023-01-18

In [26]:
print(df["Price"])
print('---------------------')
print(df.loc[1])
print('---------------------')
print(df.iloc[1])

1     1500
2      200
3      800
4    12500
5      800
Name: Price, dtype: int64
---------------------
OrderId                        101
CustomerId                       1
ProductName                 موبایل
Price                         1500
Quantity                         1
OrderDate      2023-01-15 00:00:00
Name: 1, dtype: object
---------------------
OrderId                        102
CustomerId                       2
ProductName               تلویزیون
Price                          200
Quantity                         2
OrderDate      2023-01-16 00:00:00
Name: 2, dtype: object

In [27]:
df.loc[df["ProductName"] == "لبتاب" , ["Price", "Quantity"]]

   Price  Quantity
5    800         1

In [28]:
print(df.loc[df["Price"] > 800])
print('---------------------')
print(df.loc[df["Price"] > 800, ["OrderDate"]])
print('---------------------')
print(df['Price'] > 800)
print('---------------------')
print(df[df['Price'] > 800]['OrderDate'])

   OrderId  CustomerId ProductName  Price  Quantity  OrderDate
1      101           1      موبایل   1500         1 2023-01-15
4      104           4       هدفون  12500         2 2023-01-17
---------------------
   OrderDate
1 2023-01-15
4 2023-01-17
---------------------
1     True
2    False
3    False
4     True
5    False
Name: Price, dtype: bool
---------------------
1   2023-01-15
4   2023-01-17
Name: OrderDate, dtype: datetime64[ns]

In [30]:
df["TotalSales"] = df["Price"] * df["Quantity"]
df

   OrderId  CustomerId ProductName  Price  Quantity  OrderDate  TotalSales
1      101           1      موبایل   1500         1 2023-01-15        1500
2      102           2    تلویزیون    200         2 2023-01-16         400
3      103           3      موبایل    800         3 2023-01-16        2400
4      104           4       هدفون  12500         2 2023-01-17       25000
5      105           1       لبتاب    800         1 2023-01-18         800

In [32]:
df["OrderMonth"] = df["OrderDate"].dt.month
df

,OrderId,CustomerId,ProductName,Price,Quantity,OrderDate,TotalSales,OrderMonth
1,101,1,موبایل,1500,1,2023-01-15,1500,1
2,102,2,تلویزیون,200,2,2023-01-16,400,1
3,103,3,موبایل,800,3,2023-01-16,2400,1
4,104,4,هدفون,12500,2,2023-01-17,25000,1
5,105,1,لبتاب,800,1,2023-01-18,800,1

In [34]:
df['ProductName'] = df['ProductName'].replace({"موبایل" : "تلفن هوشمند"})
df

,OrderId,CustomerId,ProductName,Price,Quantity,OrderDate,TotalSales,OrderMonth
1,101,1,تلفن هوشمند,1500,1,2023-01-15,1500,1
2,102,2,تلویزیون,200,2,2023-01-16,400,1
3,103,3,تلفن هوشمند,800,3,2023-01-16,2400,1
4,104,4,هدفون,12500,2,2023-01-17,25000,1
5,105,1,لبتاب,800,1,2023-01-18,800,1

In [35]:
df_sorted = df.sort_values(by="Quantity", ascending=False)
df_sorted.head()

,OrderId,CustomerId,ProductName,Price,Quantity,OrderDate,TotalSales,OrderMonth
3,103,3,تلفن هوشمند,800,3,2023-01-16,2400,1
2,102,2,تلویزیون,200,2,2023-01-16,400,1
4,104,4,هدفون,12500,2,2023-01-17,25000,1
1,101,1,تلفن هوشمند,1500,1,2023-01-15,1500,1
5,105,1,لبتاب,800,1,2023-01-18,800,1

In [36]:
df.groupby('ProductName')['Quantity'].sum()

ProductName
تلفن هوشمند    4
تلویزیون       2
لبتاب          1
هدفون          2
Name: Quantity, dtype: int64

In [37]:
df.groupby('ProductName')['Quantity'].count()

ProductName
تلفن هوشمند    2
تلویزیون       1
لبتاب          1
هدفون          1
Name: Quantity, dtype: int64

In [38]:
df.groupby('ProductName')['TotalSales'].mean()

ProductName
تلفن هوشمند     1950.0
تلویزیون         400.0
لبتاب            800.0
هدفون          25000.0
Name: TotalSales, dtype: float64

In [42]:
df.groupby('ProductName').agg({
    "TotalSales": ["mean", "count", "sum", "std"],
    "CustomerId": "nunique"
})

            TotalSales                          CustomerId
                  mean count    sum         std    nunique
ProductName
تلفن هوشمند     1950.0     2   3900  636.396103          2
تلویزیون         400.0     1    400         NaN          1
لبتاب            800.0     1    800         NaN          1
هدفون          25000.0     1  25000         NaN          1

In [43]:
customers = pd.DataFrame({
    "CustomerId": [1,2,3,4],
    "CustomerName": ["Ali", "Zahra", "Amir", "Neda"],
    "City": ["Tehran", "Yazd", "Tehran", "Sari"],
    "Age": [20,38,16,58]
})
customers

   CustomerId CustomerName    City  Age
0           1          Ali  Tehran   20
1           2        Zahra    Yazd   38
2           3         Amir  Tehran   16
3           4         Neda    Sari   58

In [44]:
merged_df = pd.merge(df, customers, on="CustomerId")
merged_df

,OrderId,CustomerId,ProductName,Price,Quantity,OrderDate,TotalSales,OrderMonth,CustomerName,City,Age
0,101,1,تلفن هوشمند,1500,1,2023-01-15,1500,1,Ali,Tehran,20
1,102,2,تلویزیون,200,2,2023-01-16,400,1,Zahra,Yazd,38
2,103,3,تلفن هوشمند,800,3,2023-01-16,2400,1,Amir,Tehran,16
3,104,4,هدفون,12500,2,2023-01-17,25000,1,Neda,Sari,58
4,105,1,لبتاب,800,1,2023-01-18,800,1,Ali,Tehran,20

In [45]:
df.join(customers, lsuffix='_caller', rsuffix='_other')

,OrderId,CustomerId_caller,ProductName,Price,Quantity,OrderDate,TotalSales,OrderMonth,CustomerId_other,CustomerName,City,Age
1,101,1,تلفن هوشمند,1500,1,2023-01-15,1500,1,2.0,Zahra,Yazd,38.0
2,102,2,تلویزیون,200,2,2023-01-16,400,1,3.0,Amir,Tehran,16.0
3,103,3,تلفن هوشمند,800,3,2023-01-16,2400,1,4.0,Neda,Sari,58.0
4,104,4,هدفون,12500,2,2023-01-17,25000,1,NaN,NaN,NaN,NaN
5,105,1,لبتاب,800,1,2023-01-18,800,1,NaN,NaN,NaN,NaN